# customer-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=69xvvdign5]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=3b3600e9-4ff6-42aa-982f-15f19958dc4c:customer_api]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=staging]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer_api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer_api-20230517050945968500000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 1s [id=1684930717]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-2586101c-c461-42f8-9606-a9cceec03561]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 1s [id=upstash-kafka-credential-635a61de-3519-4e07-b108-372ade056c93]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=96d5a2796634eb2082f1211d117326219c7b4598]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=kigwpce]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=4vkx8ck]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_api"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"               = "sharing-snipe-6117-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                     = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                      = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                        = "59b5aed939be46188f0b668b3f5ad1f8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                  = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                        = "c2hhcmluZy1zbmlwZS02MTE3JASUuSGrj0SAMLe4O_k63sLCih2isgE-alfErlg"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                     = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS" = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "gWV7cKclyZtdhOEk4NTK/4LHMQ6cup8PqNQINM3uxck="
                              - kty = "RSA"
                              - n   = "oZMbp2wfVW1YQIlTxcGZyA1zG9q0E7QGyNznbTNgvrHbWlX40WmUbpy_2bm__Sg11P8s6mzpvR5TTPirJMzmYLJMKd2bZLsHr4FoynTCGA_XgLjbl3J55aXC8HlYAEY6u1vzgw-RKugBzLeLBCsq8ydm4QkC3tgEbpgXJZ1fKnAsHALLmejk-4hFAW-fHcFgpo0BdjL02kehscqW6v4N15dhEqIlTJX9FV7ppF5NhvMKWcJDdetFC_Xp2VGsaL6PkBRNbBj4HDpWk6xTEg6pPDO_Fuds1xFibcZS5fp0kh1vEBlb3dscrLhwI7iWkRdZ98BpuTWOQQ2KA3wtxJm_ow"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "gNL7Qze5PFcmFiZlMPZ9Ibflx682Y03hw2L22kelOCk="
                              - kty = "RSA"
                              - n   = "tRAaSdf98te5JVmwFSXFaxUtkOzvMFtyHF8WHoHX_wLjHAf_2FrGb7NHNAqrNYxOgBju7nJIlAXwP2RWKdd2d66M8QLlsTkKDb6PWnZ6zOHVzA3NqmB2rOuiwBAAUfeytiBWyuw_vhDUYgpWYCin06i_-STlJDqtdgA_e247nFexERVR2iP4yokD_2g7Gv-QCxlzijYLkx3OcIZ6gFoGOlbEsOwtxxsa4RSDKxKa3Z5DnH4k6GNAsomRVVvopGTGqthwLD0ARgeoHtTND2e_J1Pb0FuWuCJOtvZQAN_wX-O13-49qOeM2dFM2J8JTPISQAMqL3kJsr-_Dc_WUOSsCw"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"          = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_grK7ycLvM/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "3b3600e9-4ff6-42aa-982f-15f19958dc4c:customer_api"
        name       = "customer_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "1862e991-bc98-4380-a341-6f6d5f323a51" -> "4013607e-932f-4360-b975-822076400473"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*